import json

from src.services import find_person_to_person_transactions


def test_find_person_to_person_transactions() -> None:
    transactions = [
        {"Категория": "Переводы", "Описание": "Перевод Сергей А.", "Сумма операции": -1000},
        {"Категория": "Переводы", "Описание": "Перевод Навид Б.", "Сумма операции": -1500},
        {"Категория": "Магазин", "Описание": "Покупка в магазине", "Сумма операции": -500},
        {"Категория": "Переводы", "Описание": "Перевод Вероника Э.", "Сумма операции": -2000},
        {"Категория": "Переводы", "Описание": "Перевод Игорь С.", "Сумма операции": -300},
        {"Категория": "Переводы", "Описание": "Перевод Денис.", "Сумма операции": -700},
    ]

    expected_output = json.dumps(
        [
            {"Категория": "Переводы", "Описание": "Перевод Сергей А.", "Сумма операции": -1000},
            {"Категория": "Переводы", "Описание": "Перевод Навид Б.", "Сумма операции": -1500},
            {"Категория": "Переводы", "Описание": "Перевод Вероника Э.", "Сумма операции": -2000},
            {"Категория": "Переводы", "Описание": "Перевод Игорь С.", "Сумма операции": -300},
        ],
        ensure_ascii=False,
        indent=4,
    )

    result = find_person_to_person_transactions(transactions)
    assert result == expected_output
